app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
        <td><%= post.title %></td>
		<td><%= post.comments.count %> </td>