app/views/posts/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<h2>Comments</h2>
<% if @post.comments.length > 0 %>