app/controllers/comments_controller.rb

  def create
      @post = Post.find(params[:post_id])
      #params[:comment]
      @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "asdf"], ["body", "asdf"], ["created_at", "2014-09-23 23:38:23.621362"], ["post_id", 1], ["updated_at", "2014-09-23 23:38:23.621362"]]