app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test test asdasdfasdfasdfasdfasdfasdfasdfasdf"], ["created_at", "2014-09-23 23:02:22.602809"], ["name", "Test"], ["title", "test"], ["updated_at", "2014-09-23 23:02:22.602809"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "name" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["name", "Sorry Im working now"], ["updated_at", "2014-09-24 05:54:33.641521"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)